/*
  Province-City-Country selection
  pccs.js
  author:yuanbo
-6-22 16.36
*/

function Dsy() {
    this.Items = {};
}
Dsy.prototype.add = function(id, iArray) {
    this.Items[id] = iArray;
}
Dsy.prototype.Exists = function(id) {
    if (typeof (this.Items[id]) == "undefined") return false;
    return true;
}

function change(v) {
    var str = "0";
    for (i = 0; i < v; i++) { str += ("_" + (document.getElementById(s[i]).selectedIndex - 1)); };
    var ss = document.getElementById(s[v]);
    with (ss) {
        length = 0;
        options[0] = new Option(opt0[v], opt0[v]);
        if (v && document.getElementById(s[v - 1]).selectedIndex > 0 || !v) {
            if (dsy.Exists(str)) {
                ar = dsy.Items[str];
                for (i = 0; i < ar.length; i++) options[length] = new Option(ar[i], ar[i]);
                if (v) options[1].selected = true;
            }
        }
        if (++v < s.length) { change(v); }
    }
}

var dsy = new Dsy();























dsy.add("0_24", ["阿坝藏族羌族自治州", "巴中", "成都", "达州", "德阳", "甘孜藏族自治州", "广安", "广元", "乐山", "凉山彝族自 治州", "眉山", "绵阳", "南充", "内江", "攀枝花", "遂宁", "雅安", "宜宾", "资阳", "自贡", "泸州"]);
dsy.add("0_24_0", ["阿坝县", "黑水县", "红原县", "金川县", "九寨沟县", "理县", "马尔康县", "茂县", "壤塘县", "若尔盖县", "松潘县", "小金县", "汶川县"]);
dsy.add("0_24_1", ["巴中市", "南江县", "平昌县", "通江县"]);
dsy.add("0_24_2", ["成都市", "崇州市", "大邑县", "都江堰市", "金堂县", "彭州市", "蒲江县", "双流县", "新津县", "邛崃市", "郫县"]);
dsy.add("0_24_3", ["达县", "达州市", "大竹县", "开江县", "渠县", "万源市", "宣汉县"]);
dsy.add("0_24_4", ["德阳市", "广汉市", "罗江县", "绵竹市", "什邡市", "中江县"]);
dsy.add("0_24_5", ["巴塘县", "白玉县", "丹巴县", "稻城县", "道孚县", "德格县", "得荣县", "甘孜县", "九龙县", "康定县", " 理塘县", "炉霍县", "色达县", "石渠县", "乡城县", "新龙县", "雅江县", "泸定县"]);
dsy.add("0_24_6", ["广安市", "华蓥市", "邻水县", "武胜县", "岳池县"]);
dsy.add("0_24_7", ["苍溪县", "广元市", "剑阁县", "青川县", "旺苍县"]);
dsy.add("0_24_8", ["峨边彝族自治县", "峨眉山市", "夹江县", "井研县", "乐山市", "马边彝族自治县", "沐川县", "犍为县"]);
dsy.add("0_24_9", ["布拖县", "德昌县", "甘洛县", "会东县", "会理县", "金阳县", "雷波县", "美姑县", "冕宁县", "木里藏族自治 县", "宁南县", "普格县", "西昌市", "喜德县", "盐源县", "越西县", "昭觉县"]);
dsy.add("0_24_10", ["丹棱县", "洪雅县", "眉山市", "彭山县", "青神县", "仁寿县"]);
dsy.add("0_24_11", ["安县", "北川县", "江油市", "绵阳市", "平武县", "三台县", "盐亭县", "梓潼县"]);
dsy.add("0_24_12", ["南部县", "南充市", "蓬安县", "西充县", "仪陇县", "营山县", "阆中市"]);
dsy.add("0_24_13", ["隆昌县", "内江市", "威远县", "资中县"]);
dsy.add("0_24_14", ["米易县", "攀枝花市", "盐边县"]);
dsy.add("0_24_15", ["大英县", "蓬溪县", "射洪县", "遂宁市"]);
dsy.add("0_24_16", ["宝兴县", "汉源县", "芦山县", "名山县", "石棉县", "天全县", "雅安市", "荥经县"]);
dsy.add("0_24_17", ["长宁县", "高县", "江安县", "南溪县", "屏山县", "兴文县", "宜宾市", "宜宾县", "珙县", "筠连县"]);
dsy.add("0_24_18", ["安岳县", "简阳市", "乐至县", "资阳市"]);
dsy.add("0_24_19", ["富顺县", "荣县", "自贡市"]);
dsy.add("0_24_20", ["古蔺县", "合江县", "叙永县", "泸县", "泸州市"]);


dsy.add("0_25", ["蓟县", "静海县", "宁河县", "天津市"]);
dsy.add("0_25_0", ["", "蓟县", "静海县", "宁河县", "天津市"]);

dsy.add("0_26", ["阿里", "昌都", "拉萨", "林芝", "那曲", "日喀则", "山南"]);
dsy.add("0_26_0", ["措勤县", "噶尔县", "改则县", "革吉县", "普兰县", "日土县", "札达县"]);
dsy.add("0_26_1", ["八宿县", "边坝县", "察雅县", "昌都县", "丁青县", "贡觉县", "江达县", "类乌齐县", "洛隆县", "芒康县", "左贡县"]);
dsy.add("0_26_2", ["达孜县", "当雄县", "堆龙德庆县", "拉萨市", "林周县", "墨竹工卡县", "尼木县", "曲水县"]);
dsy.add("0_26_3", ["波密县", "察隅县", "工布江达县", "朗县", "林芝县", "米林县", "墨脱县"]);
dsy.add("0_26_4", ["安多县", "巴青县", "班戈县", "比如县", "嘉黎县", "那曲县", "尼玛县", "聂荣县", "申扎县", "索县"]);
dsy.add("0_26_5", ["昂仁县", "白朗县", "定结县", "定日县", "岗巴县", "吉隆县", "江孜县", "康马县", "拉孜县", "南木林县", "聂拉木县", "仁布县", "日喀则市", "萨嘎县", "萨迦县", "谢通门县", "亚东县", "仲巴县"]);
dsy.add("0_26_6", ["措美县", "错那县", "贡嘎县", "加查县", "浪卡子县", "隆子县", "洛扎县", "乃东县", "琼结县", "曲松县", "桑日县", "扎囊县"]);


dsy.add("0_27", ["阿克苏", "阿拉尔", "巴音郭楞蒙古自治州", "博尔塔拉蒙古自治州", "昌吉回族自治州", "哈密", "和田", "喀什", "克 拉玛依", "克孜勒苏柯尔克孜自治州", "石河子", "图木舒克", "吐鲁番", "乌鲁木齐", "五家渠", "伊犁哈萨克自治州"]);
dsy.add("0_27_0", ["阿克苏市", "阿瓦提县", "拜城县", "柯坪县", "库车县", "沙雅县", "温宿县", "乌什县", "新和县"]);
dsy.add("0_27_1", ["阿拉尔市"]);
dsy.add("0_27_2", ["博湖县", "和静县", "和硕县", "库尔勒市", "轮台县", "且末县", "若羌县", "尉犁县", "焉耆回族自治县"]);
dsy.add("0_27_3", ["博乐市", "精河县", "温泉县"]);
dsy.add("0_27_4", ["昌吉市", "阜康市", "呼图壁县", "吉木萨尔县", "玛纳斯县", "米泉市", "木垒哈萨克自治县", "奇台县"]);
dsy.add("0_27_5", ["巴里坤哈萨克自治县", "哈密市", "伊吾县"]);
dsy.add("0_27_6", ["策勒县", "和田市", "和田县", "洛浦县", "民丰县", "墨玉县", "皮山县", "于田县"]);
dsy.add("0_27_7", ["巴楚县", "喀什市", "麦盖提县", "莎车县", "疏附县", "疏勒县", "塔什库尔干塔吉克自治县", "叶城县", "英吉沙县", "岳普湖县", "泽普县", "伽师县"]);
dsy.add("0_27_8", ["克拉玛依市"]);
dsy.add("0_27_9", ["阿合奇县", "阿克陶县", "阿图什市", "乌恰县"]);
dsy.add("0_27_10", ["石河子市"]);
dsy.add("0_27_11", ["图木舒克市"]);
dsy.add("0_27_12", ["吐鲁番市", "托克逊县", "鄯善县"]);
dsy.add("0_27_13", ["乌鲁木齐市", "乌鲁木齐县"]);
dsy.add("0_27_14", ["五家渠市"]);
dsy.add("0_27_15", ["阿勒泰市", "布尔津县", "察布查尔锡伯自治县", "额敏县", "福海县", "富蕴县", "巩留县", "哈巴河县", "和布 克赛尔蒙古自治县", "霍城县", "吉木乃县", "奎屯市", "尼勒克县", "青河县", "沙湾县", "塔城市", "特克斯县", "托里县", "乌苏市 ", "新源县", "伊宁市", "伊宁县", "裕民县", "昭苏县"]);


dsy.add("0_28", [" 保山", "楚雄彝族自治州", "大理白族自治州", "德宏傣族景颇族自治州", "迪庆藏族自治州", "红河哈尼族彝族自治州", "昆明", "丽江", "临 沧", "怒江傈傈族自治州", "曲靖", "思茅", "文山壮族苗族自治州", "西双版纳傣族自治州", "玉溪", "昭通"]);
dsy.add("0_28_0", ["保山市", "昌宁县", "龙陵县", "施甸县", "腾冲县"]);
dsy.add("0_28_1", ["楚雄市", "大姚县", "禄丰县", "牟定县", "南华县", "双柏县", "武定县", "姚安县", "永仁县", "元谋县"]);
dsy.add("0_28_2", ["宾川县", "大理市", "洱源县", "鹤庆县", "剑川县", "弥渡县", "南涧彝族自治县", "巍山彝族回族自治县", "祥云县", "漾濞彝族自治县", "永平县", "云龙县"]);
dsy.add("0_28_3", ["梁河县", "陇川县", "潞西市", "瑞丽市", "盈江县"]);
dsy.add("0_28_4", ["德钦县", "维西傈僳族自治县", "香格里拉县"]);
dsy.add("0_28_5", ["个旧市", "河口瑶族自治县", "红河县", "建水县", "金平苗族瑶族傣族自治县", "开远市", "绿春县", "蒙自县", "弥勒县", "屏边苗族自治县", "石屏县", "元阳县", "泸西县"]);
dsy.add("0_28_6", ["安宁市", "呈贡县", "富民县", "晋宁县", "昆明市", "禄劝彝族苗族自治县", "石林彝族自治县", "寻甸回族自治县", "宜良县", "嵩明县"]);
dsy.add("0_28_7", ["华坪县", "丽江市", "宁蒗彝族自治县", "永胜县", "玉龙纳西族自治县"]);
dsy.add("0_28_8", ["沧源佤族自治县", "凤庆县", "耿马傣族佤族治县", "临沧县", "双江拉祜族佤族布朗族傣族自治县", "永德县", "云县", "镇康县"]);
dsy.add("0_28_9", ["福贡县", "贡山独龙族怒族自治县", "兰坪白族普米族自治县", "泸水县"]);
dsy.add("0_28_10", ["富源县", "会泽县", "陆良县", "罗平县", "马龙县", "曲靖市", "师宗县", "宣威市", "沾益县"]);
dsy.add("0_28_11", ["江城哈尼族彝族自治县", "景东彝族自治县", "景谷彝族傣族自治县", "澜沧拉祜族自治县", "孟连傣族拉祜族佤族自治县 ", "墨江哈尼族自治县", "普洱哈尼族彝族自治县", "思茅市", "西盟佤族自治县", "镇沅彝族哈尼族拉祜族自治县"]);
dsy.add("0_28_12", ["富宁县", "广南县", "麻栗坡县", "马关县", "丘北县", "文山县", "西畴县", "砚山县"]);
dsy.add("0_28_13", ["景洪市", "勐海县", "勐腊县"]);
dsy.add("0_28_14", ["澄江县", "峨山彝族自治县", "华宁县", "江川县", "通海县", "新平彝族傣族自治县", "易门县", "玉溪市", "元江哈尼族彝族傣族自治县"]);
dsy.add("0_28_15", ["大关县", "鲁甸县", "巧家县", "水富县", "绥江县", "威信县", "盐津县", "彝良县", "永善县", "昭通市", "镇雄县"]);

dsy.add("0_29", ["杭州", "湖州", "嘉兴", "金华", "丽水", "宁波", "绍兴", "台州", "温州", "舟山", "衢州"]);
dsy.add("0_29_0", ["淳安县", "富阳市", "杭州市", "建德市", "临安市", "桐庐县"]);
dsy.add("0_29_1", ["安吉县", "长兴县", "德清县", "湖州市"]);
dsy.add("0_29_2", ["海宁市", "海盐县", "嘉善县", "嘉兴市", "平湖市", "桐乡市"]);
dsy.add("0_29_3", ["东阳市", "金华市", "兰溪市", "磐安县", "浦江县", "武义县", "义乌市", "永康市"]);
dsy.add("0_29_4", ["景宁畲族自治县", "丽水市", "龙泉市", "青田县", "庆元县", "松阳县", "遂昌县", "云和县", "缙云县"]);
dsy.add("0_29_5", ["慈溪市", "奉化市", "宁波市", "宁海县", "象山县", "余姚市"]);
dsy.add("0_29_6", ["上虞市", "绍兴市", "绍兴县", "新昌县", "诸暨市", "嵊州市"]);
dsy.add("0_29_7", ["临海市", "三门县", "台州市", "天台县", "温岭市", "仙居县", "玉环县"]);
dsy.add("0_29_8", ["苍南县", "洞头县", "乐清市", "平阳县", "瑞安市", "泰顺县", "温州市", "文成县", "永嘉县"]);
dsy.add("0_29_9", ["舟山市", "岱山县", "嵊泗县"]);
dsy.add("0_29_10", ["常山县", "江山市", "开化县", "龙游县", "衢州市"]);

dsy.add("0_30", ["重庆市", "沙坪坝","渝中","江北","南岸","九龙坡","大渡口","渝北","北碚","万盛","双桥","巴南","万州","涪陵","黔江","长寿","城口县", "大足县", "垫江县", "丰都县", "奉节县", "合川市", "江津市", "开县", "梁平县", "南川市", "彭 水苗族土家族自治县", "荣昌县", "石柱土家族自治县", "铜梁县", "巫山县", "巫溪县", "武隆县", "秀山土家族苗族自治县", "永川市", " 酉阳土家族苗族自治县", "云阳县", "忠县", "潼南县", "璧山县", "綦江县"]);
dsy.add("0_30_0", ["城口县", "大足县", "垫江县", "丰都县", "奉节县", "合川市", "江津市", "开县", "梁平县", "南川市", "彭 水苗族土家族自治县", "荣昌县", "石柱土家族自治县", "铜梁县", "巫山县", "巫溪县", "武隆县", "秀山土家族苗族自治县", "永川市", " 酉阳土家族苗族自治县", "云阳县", "忠县", "重庆市", "潼南县", "璧山县", "綦江县"]);

var s = ["province", "city", "county"];
var opt0 = ["省份", "地级市", "市、县级市、县"];
function setup() {
    for (i = 0; i < s.length - 1; i++)
        document.getElementById(s[i]).onchange = new Function("change(" + (i + 1) + ")");
    change(0);
}